eisup_2019_docmng_integration/src/Documents/СписаниеРасходовБудущихПериодов/СписаниеРасходовБудущихПериодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеРасходовБудущихПериодов</name>
  <comment>(Регл)</comment>
  <registerRecords>AccumulationRegister.БракВПроизводствеНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.РасшифровкаКУДиР</registerRecords>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоБУ</registerRecords>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоНУ</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводствеБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатратРегл</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.РасчетСписанияРБП</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ГруппаРБП</name>
    <type>
      <types>CatalogRef.РасходыБудущихПериодов</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартийНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/InformationRegisters/РасчетСписанияРБП/РасчетСписанияРБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетСписанияРБП</name>
  <comment>Расчет списания расходов будущих периодов</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМесяцевДнейТекущегоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМесяцевДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.РасходыБудущихПериодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетСписания</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>String</types>
      <types>ChartOfAccountsRef.Налоговый</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособПризнанияРасходов</name>
    <type>
      <types>EnumRef.СпособыПризнанияРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыРБП/ВидыРБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРБП</name>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ДолгосрочноеСтрахованиеЖизни</name>
  </enumValues>
  <enumValues>
    <name>СтрахованиеНаОплатуМедицинскихРасходов</name>
  </enumValues>
  <enumValues>
    <name>СтрахованиеНаСлучайСмертиИУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>ОтрицательныйРезультатОтРеализацииАмортизируемогоИмущества</name>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВидыСтрахования</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/СписаниеРасходовБудущихПериодов/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, ПериодРегистрации");

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ)
	
	мПроводкиБУ   = Движения.Хозрасчетный;
	мПроводкиНУ   = Движения.Налоговый;

	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыРБП.Прочие);
	Массив.Добавить(Перечисления.ВидыРБП.ОсвоениеПриродныхРесурсов);
	Массив.Добавить(Перечисления.ВидыРБП.ОтрицательныйРезультатОтРеализацииАмортизируемогоИмущества);
	
	ЗаписьРасчетаРБП = Движения.РасчетСписанияРБП.Выгрузить();
	ЗаписьРасчетаРБП.Очистить();
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда           		
		
		// АБС ИЗМЕНЕНО Списание РБП по группам
		Если ЗначениеЗаполнено(абс_ГруппаРБП) Тогда
			БухгалтерскийУчет.РасчетИСписаниеРПБ(СтруктураШапкиДокумента, Отказ, Массив, "БУ", мПроводкиБУ, ЗаписьРасчетаРБП, абс_ГруппаРБП);
		Иначе
			БухгалтерскийУчет.РасчетИСписаниеРПБ(СтруктураШапкиДокумента, Отказ, Массив, "БУ", мПроводкиБУ, ЗаписьРасчетаРБП);
		КонецЕсли;
		// АБС ИЗМЕНЕНО Списание РБП по группам КОНЕЦ
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		
		// АБС ИЗМЕНЕНО Списание РБП по группам
		Если ЗначениеЗаполнено(абс_ГруппаРБП) Тогда
			БухгалтерскийУчет.РасчетИСписаниеРПБ(СтруктураШапкиДокумента, Отказ, Массив, "НУ", мПроводкиНУ, ЗаписьРасчетаРБП, абс_ГруппаРБП);
		Иначе
			БухгалтерскийУчет.РасчетИСписаниеРПБ(СтруктураШапкиДокумента, Отказ, Массив, "НУ", мПроводкиНУ, ЗаписьРасчетаРБП);
		КонецЕсли;
		// АБС ИЗМЕНЕНО Списание РБП по группам КОНЕЦ
		
	КонецЕсли;
	

	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчетеУСН Тогда

		НалоговыйУчетУСН.ОтразитьВУСН(Ссылка, "СписаниеРБП",,0);
			
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;


	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ)
	
	//АБС ВСТАВКА 38320  31.01.2014 19:16:46  Пугачев
	#Если Клиент Тогда
		абс_БСПОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(Справочники.абс_БСПКлючевыеОперации.РасходыБудущихПериодов_Проведение);
	#Иначе
		ВремяНачала = абс_БСПОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
	#КонецЕсли
	//АБС ВСТАВКА 38320 КОНЕЦ 
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	мНачДата = НачалоМесяца(ПериодРегистрации);
	мКонДата  = КонецМесяца(ПериодРегистрации);
	
	мНачГраница = Новый Граница(мНачДата, ВидГраницы.Включая);
	мКонГраница = Новый Граница(мКонДата, ВидГраницы.Включая);
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = УправлениеЗапасами.СформироватьДеревоПолейЗапросаПоШапке();
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаРегламентированногоУчета", "ВалютаДокумента");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	мПрименениеУСН = НалоговыйУчетУСН.ПрименениеУСН(СтруктураШапкиДокумента.Организация, мКонДата);
	
	СтруктураШапкиДокумента.Вставить("мНачДата",    мНачДата);
	СтруктураШапкиДокумента.Вставить("мКонДата",    мКонДата);
	СтруктураШапкиДокумента.Вставить("мНачГраница", мНачГраница);
	СтруктураШапкиДокумента.Вставить("мКонГраница", мКонГраница);
	СтруктураШапкиДокумента.Вставить("мПрименениеУСН",мПрименениеУСН);
	
	Заголовок = "";
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ);
	КонецЕсли;
		
	//АБС ВСТАВКА 38320  31.01.2014 19:16:46  Пугачев
	#Если Клиент Тогда
		
	#Иначе
		абс_БСПОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(Справочники.абс_БСПКлючевыеОперации.РасходыБудущихПериодов_Проведение, ВремяНачала);
	#КонецЕсли
	//АБС ВСТАВКА 38320 КОНЕЦ 
	
КонецПроцедуры // ОбработкаПроведения()

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли; 
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	БухгалтерскийУчет.ПечатьСправкиРасчета(Отчеты.СправкаРасчетСписаниеРБП, Новый Структура("Организация,Дата", Организация, Дата));
	
КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
 Возврат Новый Структура("РБП","Справка-расчет");
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
